# Basic SQL imports

In [1]:
%load_ext sql

In [2]:
import csv, sqlite3
con = sqlite3.connect('MyEmpData.db')
cur = con.cursor()

In [3]:
%sql sqlite:///MyEmpData.db

In [4]:
from warnings import filterwarnings
filterwarnings("ignore")

# Read Dataset

In [5]:
import pandas as pd

In [6]:
A=pd.read_csv(r"C:\Users\Aishwarya\OneDrive\Desktop\SQL\3rd\EmployeeData.csv")
A.head()

   empid    fname    lname    sal  did
0    101  Utkarsh  Gaikwad  20000   10
1    102  Sarthak   Sharma  25000   20
2    103    Raman    Verma  35000   30
3    104   Rakesh     Jain  40000   20
4    105    Aditi     Naik  37000   20

# Import the dataframe to sql

In [7]:
A.to_sql("Employees",con,if_exists="replace",index=False)

10

# Seeing the Entire data with select query

In [8]:
%%sql
SELECT * FROM Employees

 * sqlite:///MyEmpData.db
Done.

[(101, 'Utkarsh', 'Gaikwad', 20000, 10),
 (102, 'Sarthak', 'Sharma', 25000, 20),
 (103, 'Raman', 'Verma', 35000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (105, 'Aditi', 'Naik', 37000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30),
 (108, 'Narayan', 'More', 45000, 30),
 (109, 'Atif', 'Khan', 34000, 10),
 (110, 'Ramesh', 'Gaud', 26000, 10)]

# Select Specific Columns from the data

In [9]:
%%sql
SELECT fname,lname FROM Employees;

 * sqlite:///MyEmpData.db
Done.

[('Utkarsh', 'Gaikwad'),
 ('Sarthak', 'Sharma'),
 ('Raman', 'Verma'),
 ('Rakesh', 'Jain'),
 ('Aditi', 'Naik'),
 ('Suresh', 'More'),
 ('Sayali', 'Kale'),
 ('Narayan', 'More'),
 ('Atif', 'Khan'),
 ('Ramesh', 'Gaud')]

In [10]:
%%sql
SELECT empid,sal FROM Employees;

 * sqlite:///MyEmpData.db
Done.

[(101, 20000),
 (102, 25000),
 (103, 35000),
 (104, 40000),
 (105, 37000),
 (106, 36000),
 (107, 40000),
 (108, 45000),
 (109, 34000),
 (110, 26000)]

#  *Where Clause

## Find out employees who's salary is greater than or equal to 35000

In [12]:
%%sql
SELECT * FROM Employees
WHERE sal>=35000;

 * sqlite:///MyEmpData.db
Done.

[(103, 'Raman', 'Verma', 35000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (105, 'Aditi', 'Naik', 37000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30),
 (108, 'Narayan', 'More', 45000, 30)]

In [14]:
%%sql
SELECT fname,sal FROM Employees
WHERE sal>=35000;

 * sqlite:///MyEmpData.db
Done.

[('Raman', 35000),
 ('Rakesh', 40000),
 ('Aditi', 37000),
 ('Suresh', 36000),
 ('Sayali', 40000),
 ('Narayan', 45000)]

In [15]:
A[A.sal>=35000]

   empid    fname  lname    sal  did
2    103    Raman  Verma  35000   30
3    104   Rakesh   Jain  40000   20
4    105    Aditi   Naik  37000   20
5    106   Suresh   More  36000   10
6    107   Sayali   Kale  40000   30
7    108  Narayan   More  45000   30

# Find out employee name who are in did 20

In [16]:
%%sql
SELECT fname,lname,did FROM Employees
WHERE did=20;

 * sqlite:///MyEmpData.db
Done.

[('Sarthak', 'Sharma', 20), ('Rakesh', 'Jain', 20), ('Aditi', 'Naik', 20)]

# Find out employee first names starting from S

In [19]:
%%sql
SELECT * FROM Employees
WHERE fname LIKE "S%";

 * sqlite:///MyEmpData.db
Done.

[(102, 'Sarthak', 'Sharma', 25000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30)]

# Find employees who's last name ends with e

In [24]:
%%sql
SELECT * FROM Employees
WHERE lname LIKE "%e"

 * sqlite:///MyEmpData.db
Done.

[(106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30),
 (108, 'Narayan', 'More', 45000, 30)]

# Aggreagation Function - AVG, SUM and COUNT

# Find out total salary

In [25]:
%%sql
SELECT SUM(sal) FROM Employees;

 * sqlite:///MyEmpData.db
Done.

[(338000,)]

In [26]:
A["sal"].sum()    #pandas

338000

# Find out average Salary

In [27]:
%%sql
SELECT AVG(sal) FROM Employees;

 * sqlite:///MyEmpData.db
Done.

[(33800.0,)]

In [29]:
A["sal"].mean()    #pandas

33800.0

# Find out empoyee count where sal < 30000

In [30]:
%%sql
SELECT fname,empid FROM Employees
WHERE sal<=30000;

 * sqlite:///MyEmpData.db
Done.

[('Utkarsh', 101), ('Sarthak', 102), ('Ramesh', 110)]

In [31]:
%%sql
SELECT * FROM Employees

 * sqlite:///MyEmpData.db
Done.

[(101, 'Utkarsh', 'Gaikwad', 20000, 10),
 (102, 'Sarthak', 'Sharma', 25000, 20),
 (103, 'Raman', 'Verma', 35000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (105, 'Aditi', 'Naik', 37000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30),
 (108, 'Narayan', 'More', 45000, 30),
 (109, 'Atif', 'Khan', 34000, 10),
 (110, 'Ramesh', 'Gaud', 26000, 10)]

# Unique values counting

In [32]:
%%sql
SELECT DISTINCT did FROM Employees;

 * sqlite:///MyEmpData.db
Done.

[(10,), (20,), (30,)]

In [35]:
%%sql
SELECT COUNT(DISTINCT did) FROM Employees;

 * sqlite:///MyEmpData.db
Done.

[(3,)]

# Find employees whose salary is less than average salary

In [43]:
%%sql
SELECT AVG(Sal) FROM Employees;

 * sqlite:///MyEmpData.db
Done.

[(33800.0,)]

In [45]:
%%sql
SELECT * From Employees
WHERE Sal<(SELECT AVG(Sal) FROM Employees);

 * sqlite:///MyEmpData.db
Done.

[(101, 'Utkarsh', 'Gaikwad', 20000, 10),
 (102, 'Sarthak', 'Sharma', 25000, 20),
 (110, 'Ramesh', 'Gaud', 26000, 10)]

# Order by Clause

# Sort the employees on basic of salary in descending order

In [47]:
%%sql
SELECT * FROM Employees
ORDER BY sal DESC;

 * sqlite:///MyEmpData.db
Done.

[(108, 'Narayan', 'More', 45000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (107, 'Sayali', 'Kale', 40000, 30),
 (105, 'Aditi', 'Naik', 37000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (103, 'Raman', 'Verma', 35000, 30),
 (109, 'Atif', 'Khan', 34000, 10),
 (110, 'Ramesh', 'Gaud', 26000, 10),
 (102, 'Sarthak', 'Sharma', 25000, 20),
 (101, 'Utkarsh', 'Gaikwad', 20000, 10)]

# Show me names and salary of top 3 highest saliried employees

In [46]:
%%sql
SELECT fname,lname,sal FROM Employees
ORDER BY sal DESC
LIMIT 3;

 * sqlite:///MyEmpData.db
Done.

[('Narayan', 'More', 45000),
 ('Rakesh', 'Jain', 40000),
 ('Sayali', 'Kale', 40000)]

# Group By Clause

# Find out average salary based on department id

In [48]:
%%sql
SELECT did,AVG(sal) FROM Employees
GROUP BY did

 * sqlite:///MyEmpData.db
Done.

[(10, 29000.0), (20, 34000.0), (30, 40000.0)]

In [49]:
%%sql
SELECT did, AVG(sal) FROM Employees
GROUP BY did
ORDER BY AVG (sal) DESC;

 * sqlite:///MyEmpData.db
Done.

[(30, 40000.0), (20, 34000.0), (10, 29000.0)]

In [53]:
A.groupby(by="did")["sal"].mean()   #pandas

did
10    29000.0
20    34000.0
30    40000.0
Name: sal, dtype: float64